![Dataging](https://raw.githubusercontent.com/dataging/public-resources/61263724aea5476ba5ebf38478beada519091957/logodataging.png)
# Repaso b치sico de Pandas

El objetivo de estos ejercicios es repasar los conceptos b치sicos de Pandas

In [2]:
#Importamos el paquete de pandas
import pandas as pd

#El Dataframe es el objeto b치sico de manejo de datos en Pandas. 
#Los Dataframes est치n compuesto por una lista de Series que podemos especificar como diccionarios para generar el DataFrame

city_names = pd.Series(['San Francisco', 'San Jose', 'Sacramento'])
population = pd.Series([852469, 1015785, 485199])

pd.DataFrame({ 'City name': city_names, 'Population': population })

       City name  Population
0  San Francisco      852469
1       San Jose     1015785
2     Sacramento      485199

In [3]:
#Lo habitual es generar los Dataframe a partir de lecturas de dato de origen

california_housing_dataframe = pd.read_csv("https://download.mlcc.google.com/mledu-datasets/california_housing_train.csv", sep=",")
california_housing_dataframe.describe()

          longitude      latitude  ...  median_income  median_house_value
count  17000.000000  17000.000000  ...   17000.000000        17000.000000
mean    -119.562108     35.625225  ...       3.883578       207300.912353
std        2.005166      2.137340  ...       1.908157       115983.764387
min     -124.350000     32.540000  ...       0.499900        14999.000000
25%     -121.790000     33.930000  ...       2.566375       119400.000000
50%     -118.490000     34.250000  ...       3.544600       180400.000000
75%     -118.000000     37.720000  ...       4.767000       265000.000000
max     -114.310000     41.950000  ...      15.000100       500001.000000

[8 rows x 9 columns]

In [ ]:
#Para el acceso a los datos de los Dataframes podemos utilizar operaciones de lista o diccionario de Python

cities = pd.DataFrame({ 'City name': city_names, 'Population': population })
print(type(cities['City name']))
cities['City name']

<class 'pandas.core.series.Series'>

0    San Francisco
1         San Jose
2       Sacramento
Name: City name, dtype: object

In [ ]:
#Accedemos a la primera ocurrencia (fila) del Dataframe

print(type(cities['City name'][1]))
cities['City name'][1]

<class 'str'>

'San Jose'

In [ ]:
#Obtenemos un Dataframe con las dos primeras filas
print(type(cities[0:2]))
cities[0:2]

<class 'pandas.core.frame.DataFrame'>

       City name  Population
0  San Francisco      852469
1       San Jose     1015785

In [ ]:
#Modificar un Dataframe tambi칠n es muy sencillo, por ejemplo el siguiente c칩digo a침ade dos Series al Dataframe existente

cities['Area square miles'] = pd.Series([46.87, 176.53, 97.92])
cities['Population density'] = cities['Population'] / cities['Area square miles']
cities

       City name  Population  Area square miles  Population density
0  San Francisco      852469              46.87        18187.945381
1       San Jose     1015785             176.53         5754.177760
2     Sacramento      485199              97.92         4955.055147

# Ejercicio #1
Modifica la tabla de ciudades a침adiendo una nueva columna boolean que ser치 True si y solo si las siguientes dos condiciones son verdaderas:

La ciudad se nombra despu칠s de un San
La ciudad tiene un 치rea mayor de 50 millas cuadradas

Nota: Las Series Boolean se combina utilizando bitwise en lugar de los operadores booleanos tradicionales. Por ejemplo, cuando queremos realizar un and l칩gico, utilizamos & en lugar de and

In [ ]:
#Tu soluci칩n
cities['Is wide and has saint name'] = (cities['Area square miles'] > 50) & cities['City name'].apply(lambda name: name.startswith('San'))
cities

       City name  Population  ...  Population density  Is wide and has saint name
0  San Francisco      852469  ...        18187.945381                       False
1       San Jose     1015785  ...         5754.177760                        True
2     Sacramento      485199  ...         4955.055147                       False

[3 rows x 5 columns]

# Indexes
Tanto las Series como los Dataframe definen la propiedad index que asigna un identificador a cada fila 
Por defecto, en su construcci칩n, pandas asigna valores de 칤ndice que reflejan la ordenaci칩n de los datos de origen. Una vez creados, los valores del 칤ndice son estable, es decir, no cambian cuando los datos se reordenan

In [ ]:
city_names.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
cities.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
#Podemos llamar a reindex para ordernar manualmente las filas. Por ejemplo, el siguiente c칩digo tendr칤a el mismo efecto que ordenar por nombre de ciudad
cities.reindex([2, 0, 1])

       City name  Population  ...  Population density  Is wide and has saint name
2     Sacramento      485199  ...         4955.055147                       False
0  San Francisco      852469  ...        18187.945381                       False
1       San Jose     1015785  ...         5754.177760                        True

[3 rows x 5 columns]

In [ ]:
#Reindexar es un buen modo de barajar(aleatoriamente) un Dataframe. En el siguiente ejemplo le pasamos el 칤ndice a a la funci칩n `random.permutation`que baraja sus valores en l칤nea. 
#Llamar a reindex de este modo reordena aleatoriomente las filas

import numpy as np
cities.reindex(np.random.permutation(cities.index))

       City name  Population  ...  Population density  Is wide and has saint name
2     Sacramento      485199  ...         4955.055147                       False
1       San Jose     1015785  ...         5754.177760                        True
0  San Francisco      852469  ...        18187.945381                       False

[3 rows x 5 columns]

# Ejercicio #2
El m칠todo reindex permite indexar valores que no est치n en los valores originales del 칤ndice del Dataframe. Pru칠balo y mira lo que ocurre si utilizamos esos valores. Porque crees que se permite hacer esto?

In [ ]:
#Tu codigo
cities.reindex([0, 4, 5, 2])

       City name  Population  ...  Population density  Is wide and has saint name
0  San Francisco    852469.0  ...        18187.945381                       False
4            NaN         NaN  ...                 NaN                         NaN
5            NaN         NaN  ...                 NaN                         NaN
2     Sacramento    485199.0  ...         4955.055147                       False

[4 rows x 5 columns]

# Dataframe de las diapositivas

In [1]:
import pandas as pd

# Diccionario con los datos
data = {
    'Col1': [2012, 2013, 2013, 2014],
    'Col2': [14, 13, 34, 23],
    'Col3': [45, 76, 65, 47]
}

# Creaci칩n del DataFrame
df = pd.DataFrame(data)

# Mostrar el DataFrame
print(df)

   Col1  Col2  Col3
0  2012    14    45
1  2013    13    76
2  2013    34    65
3  2014    23    47

In [2]:
# Devuelve el tipo de datos de cada columna, cuenteo de valores nulos y uso de memoria
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    4 non-null      int64
 1   Col2    4 non-null      int64
 2   Col3    4 non-null      int64
dtypes: int64(3)
memory usage: 228.0 bytes

In [3]:
# Devuelve informaci칩n estad칤stica de las columnas num칠ricas
df.describe()

              Col1       Col2       Col3
count     4.000000   4.000000   4.000000
mean   2013.000000  21.000000  58.250000
std       0.816497   9.763879  14.863266
min    2012.000000  13.000000  45.000000
25%    2012.750000  13.750000  46.500000
50%    2013.000000  18.500000  56.000000
75%    2013.250000  25.750000  67.750000
max    2014.000000  34.000000  76.000000

In [13]:
df1 = df ["Col2"]
df1

0    14
1    13
2    34
3    23
Name: Col2, dtype: int64

In [14]:
df[["Col1", "Col2"]]

   Col1  Col2
0  2012    14
1  2013    13
2  2013    34
3  2014    23

In [2]:
df

   Col1  Col2  Col3
0  2012    14    45
1  2013    13    76
2  2013    34    65
3  2014    23    47

In [23]:
df[1:4:2]

   Col1  Col2  Col3
1  2013    13    76
3  2014    23    47

In [16]:
df[:3]

   Col1  Col2  Col3
0  2012    14    45
1  2013    13    76
2  2013    34    65

In [20]:
df["Col2"][1:2]

1    13
Name: Col2, dtype: int64

In [22]:
df["Col4"] = df["Col2"] + df["Col3"]
df

   Col1  Col2  Col3  Col4
0  2012    14    45    59
1  2013    13    76    89
2  2013    34    65    99
3  2014    23    47    70

In [26]:
df.drop("Col3", axis=1, inplace=True)
df

   Col1  Col2
0  2012    14
1  2013    13
2  2013    34
3  2014    23

In [32]:
df= df.groupby("Col1").sum()
df

      Col2  Col3
Col1
2012    14    45
2013    47   141
2014    23    47

## Datos en json con Pandas

In [2]:
import pandas as pd 


#generamos datos en json para el ejemplo

datos ={
    "tienda":{
        "categorias":[
            {"nombre":"Electr칩nica", "productos":[{"nombre":"ordenador","precio":1000, "rating":4.5},{"nombre":"tablet","precio":500, "rating":4.7}]},
            {"nombre":"Ropa", "productos":[{"nombre":"pantal칩n","precio":40, "rating":4.0},{"nombre":"camiseta","precio":20, "rating":4.2}]}
        ],
        "ubicaci칩n":{"ciudad":"Madrid", "region":"Centro"}
    }
}

#Necesitamos "aplanar" los datos para poder cargarlos en un DataFrame

df=pd.json_normalize(datos['tienda']['categorias'], record_path='productos', meta=['nombre'], meta_prefix="categoria_")

df.head()

      nombre  precio  rating categoria_nombre
0  ordenador    1000     4.5      Electr칩nica
1     tablet     500     4.7      Electr칩nica
2   pantal칩n      40     4.0             Ropa
3   camiseta      20     4.2             Ropa

In [3]:
datos_categorias = df.groupby('categoria_nombre').agg({'precio':'mean', 'rating':'mean'}).reset_index()
datos_categorias

  categoria_nombre  precio  rating
0      Electr칩nica   750.0     4.6
1             Ropa    30.0     4.1